anachrocomputer/STM32_SSD1351/RisibleRadar/RisibleRadar.c
   const int dx = abs(x2 - x1);
   const int dy = abs(y2 - y1);

   if (((y1 > y2) && (dx < dy)) || ((x1 > x2) && (dx > dy))) {
      int temp;
      
      temp = y1;
      y1 = y2;
      y2 = temp;

      temp = x1;
      x1 = x2;
      x2 = temp;
   }

   if (dy > dx) {
      d = (2 * dx) - dy;     /* Slope > 1 */
      i1 = 2 * dx;
      i2 = 2 * (dx - dy);

      if (y1 > y2) {
         x = x2;
         y = y2;
         yend = y1;
      }
      else {
         x = x1;
         y = y1;
         yend = y2;
      }

      if (x1 > x2)
         xinc = -1;
      else
         xinc = 1;

      drawPixel(x, y, c);

      while (y < yend) {
         y++;    
         if (d < 0)
            d += i1;
         else {
            x += xinc;
            d += i2;
         }

         drawPixel(x, y, c);
      }
   }
   else {          
      d = (2 * dy) - dx;  /* Slope < 1 */
      i1 = 2 * dy;
      i2 = 2 * (dy - dx);

      if (x1 > x2) {
         x = x2;
         y = y2;
         xend = x1;
      }
      else {
         x = x1;
         y = y1;
         xend = x2;
      }

      if (y1 > y2)
         yinc = -1;
      else
         yinc = 1;

      drawPixel(x, y, c);

      while (x < xend) {
         x++;
         if (d < 0)
            d += i1;
         else {
            y += yinc;
            d += i2;
         }

         drawPixel(x, y, c);
      }
   }
}


/* drawVline --- draw vertical line */

void drawVline(const unsigned int x, const unsigned int y1, const unsigned int y2, const uint16_t c)
{
   unsigned int y;

   for (y = y1; y <= y2; y++)
      Frame[y][x] = c;
}


/* drawHline --- draw pixels in a horizontal line */

void drawHline(const unsigned int x1, const unsigned int x2, const unsigned int y, const uint16_t c)
{
   unsigned int x;

   for (x = x1; x <= x2; x++)
      Frame[y][x] = c;
}


/* cfill --- draw horizontal lines to fill a circle */

static void cfill(const int x0, const int y0, const int x, const int y, const int c)
{
   drawHline(x0 - x, x0 + x, y0 + y, c);
   drawHline(x0 - x, x0 + x, y0 - y, c);
   drawHline(x0 - y, x0 + y, y0 + x, c);
   drawHline(x0 - y, x0 + y, y0 - x, c);
}


/* cpts4 --- draw four pixels to form the edge of a circle */

static void cpts4(const int x0, const int y0, const int x, const int y, const int c)
{
   drawPixel(x0 + x, y0 + y, c);

//  if (x != 0)
   drawPixel(x0 - x, y0 + y, c);

//  if (y != 0)  
   drawPixel(x0 + x, y0 - y, c);

//  if ((x != 0) && (y != 0))
   drawPixel(x0 - x, y0 - y, c);
}


/* cpts8 --- draw eight pixels to form the edge of a circle */

static void cpts8(const int x0, const int y0, const int x, const int y, const int c)
{
  cpts4 (x0, y0, x, y, c);

// if (x != y)
    cpts4 (x0, y0, y, x, c);
}


/* splitcfill --- draw horizontal lines to fill a circle */

static void splitcfill(const int x0, const int y0, const int x1, const int y1, const int x, const int y, const int c)
{
   drawHline(x0 - x, x1 + x, y1 + y, c);
   drawHline(x0 - x, x1 + x, y0 - y, c);
   drawHline(x0 - y, x1 + y, y1 + x, c);
   drawHline(x0 - y, x1 + y, y0 - x, c);
}


/* splitcpts4 --- draw four pixels to form the edge of a split circle */

static void splitcpts4(const int x0, const int y0, const int x1, const int y1, const int x, const int y, const int c)
{
   drawPixel(x1 + x, y1 + y, c);

//  if (x != 0)
   drawPixel(x0 - x, y1 + y, c);

//  if (y != 0)  
   drawPixel(x1 + x, y0 - y, c);

//  if ((x != 0) && (y != 0))
   drawPixel(x0 - x, y0 - y, c);
}


/* splitcpts8 --- draw eight pixels to form the edge of a split circle */

static void splitcpts8(const int x0, const int y0, const int x1, const int y1, const int x, const int y, const int c)
{
   splitcpts4(x0, y0, x1, y1, x, y, c);

// if (x != y)
      splitcpts4(x0, y0, x1, y1, y, x, c);
}


/* circle --- draw a circle with edge and fill colours */

void circle(const int x0, const int y0, const int r, const int ec, const int fc)
{
   // Michener's circle algorithm. Originally coded on the IBM PC
   // with EGA card in 1986.
   int x, y;
   int d;

   x = 0;
   y = r;
   d = 3 - (2 * r);

   if (fc >= 0) {
      while (x < y) {
         cfill(x0, y0, x, y, fc);
         if (d < 0) {
            d += (4 * x) + 6;
         }
         else {
            d += (4 * (x - y)) + 10;
            y--;
         }
         x++;
      }

      if (x == y)
         cfill(x0, y0, x, y, fc);
   }

   x = 0;
   y = r;
   d = 3 - (2 * r);

   while (x < y) {
      cpts8(x0, y0, x, y, ec);
      if (d < 0) {
         d += (4 * x) + 6;
      }
      else {
         d += (4 * (x - y)) + 10;
         y--;
      }
      x++;
   }

   if (x == y)
      cpts8(x0, y0, x, y, ec);
}


/* drawSplitCircle --- draw a split circle with edge and fill colours */

void drawSplitCircle(const int x0, const int y0, const int x1, const int y1, const int r, const int ec, const int fc)
{
   // Michener's circle algorithm. Originally coded on the IBM PC
   // with EGA card in 1986.
   int x, y;
   int d;

   x = 0;
   y = r;
   d = 3 - (2 * r);

   if (fc >= 0) {
      while (x < y) {
         splitcfill(x0, y0, x1, y1, x, y, fc);
         if (d < 0) {
            d += (4 * x) + 6;
         }
         else {
            d += (4 * (x - y)) + 10;
            y--;
         }
         x++;
      }

      if (x == y)
         splitcfill(x0, y0, x1, y1, x, y, fc);
   }

   x = 0;
   y = r;
   d = 3 - (2 * r);

   while (x < y) {
      splitcpts8(x0, y0, x1, y1, x, y, ec);
      if (d < 0) {
         d += (4 * x) + 6;
      }
      else {
         d += (4 * (x - y)) + 10;
         y--;
      }
      x++;
   }

   if (x == y)
      splitcpts8(x0, y0, x1, y1, x, y, ec);
}


/* fillRoundRect --- fill a rounded rectangle */

void fillRoundRect(const int x0, const int y0, const int x1, const int y1, const int r, const uint16_t ec, const uint16_t fc)
{
   int y;

   drawSplitCircle(x0 + r, y0 + r, x1 - r, y1 - r, r, ec, fc);

   drawHline(x0 + r, x1 - r, y0, ec);
   drawHline(x0 + r, x1 - r, y1, ec);
   drawVline(x0, y0 + r, y1 - r, ec);
   drawVline(x1, y0 + r, y1 - r, ec);

   for (y = y0 + r; y < (y1 - r); y++)
      drawHline (x0 + 1, x1 - 1, y, fc);
}


