anachrocomputer/STM32_SSD1351/RisibleRadar/RisibleRadar.c
/* textRoundRect --- draw text centralised in a rounded rectangle */

void textRoundRect(const char *const str, const int ec, const int fc, const int tc)
{
   const int len = strlen(str);
   const int x1 = CENX - (3 * len);
   const int x2 = CENX + (3 * len);
   
   fillRoundRect(x1 - 2, CENY - 8, x2 + 2, CENY + 12, 7, ec, fc);
   setText(x1, CENY, str);
}


/* greyFrame --- clear entire frame to checkerboard pattern */

void greyFrame(void)
{
    int r, c;

    for (r = 0; r < MAXY; r += 2)
    {
        for (c = 0; c < MAXX; c += 2)
        {
            Frame[r][c] = SSD1351_BLACK;
            Frame[r][c + 1] = SSD1351_WHITE;
        }
        
        for (c = 0; c < MAXX; c += 2)
        {
            Frame[r + 1][c] = SSD1351_WHITE;
            Frame[r + 1][c + 1] = SSD1351_BLACK;
        }
    }
}


/* setRect --- set pixels in a (non-filled) rectangle */

void setRect(const int x1, const int y1, const int x2, const int y2, const uint16_t c)
{
    drawHline(x1, x2, y1, c);
    drawVline(x2, y1, y2, c);
    drawHline(x1, x2, y2, c);
    drawVline(x1, y1, y2, c);
}


/* fillRect --- set pixels in a filled rectangle */

void fillRect(const int x1, const int y1, const int x2, const int y2, const uint16_t ec, const uint16_t fc)
{
    int y;

    for (y = y1; y <= y2; y++)
        drawHline(x1, x2, y, fc);

    drawHline(x1, x2, y1, ec);
    drawVline(x2, y1, y2, ec);
    drawHline(x1, x2, y2, ec);
    drawVline(x1, y1, y2, ec);
}


/* renderBitmap --- render pixels into the framebuffer according to a bitmap */

void renderBitmap(const int x1, const int y1, const int wd, const int ht, const uint8_t *bitmap, const int stride, const uint16_t fg, const uint16_t bg)
{
    int x, y;
    int i, j;
    const uint8_t *row;
    const int x2 = x1 + wd - 1;
    const int y2 = y1 + ht - 1;
    
    for (y = y1, i = 0; y <= y2; y++, i++) {
        row = bitmap + (stride * (i / 8));
        
        for (x = x1, j = 0; x <= x2; x++, j++)
            if (row[j] & (1 << (i % 8)))
                Frame[y][x] = fg;
            else
                Frame[y][x] = bg;
    }
}


/* drawBackground --- draw the screen background */

void drawBackground(void)
{
   int x, y;

   // Checkerboard background
   for (y = 0; y < MAXY; y++) {
      for (x = 0; x < MAXX; x += 2) {
         if (y & 1) {
            drawPixel(x, y, SSD1351_WHITE);
            drawPixel(x + 1, y, SSD1351_BLACK);
         }
         else {
            drawPixel(x, y, SSD1351_BLACK);
            drawPixel(x + 1, y, SSD1351_WHITE);
         }  
      }
   }

   // Four cases where the edge of the playing area is visible
   if (Player.x < CENX) {
      fillRect(0, 0, CENX - Player.x, MAXY - 1, SSD1351_BLACK, SSD1351_BLACK);
   }

   if (Player.y < CENY) {
      fillRect(0, 0, MAXX - 1, CENY - Player.y, SSD1351_BLACK, SSD1351_BLACK);
   }

   if ((MAXPLAYX - Player.x) < CENX) {
      fillRect((MAXPLAYX - Player.x) + CENX, 0, MAXX - 1, MAXY - 1, SSD1351_BLACK, SSD1351_BLACK);
   }

   if ((MAXPLAYY - Player.y) < CENY) {
      fillRect(0, (MAXPLAYY - Player.y) + CENY, MAXX - 1, MAXY - 1, SSD1351_BLACK, SSD1351_BLACK);
   }
}


/* drawRadarScreen --- draw the basic circular radar scope */

void drawRadarScreen(const int radius, const bool rings, const bool axes)
{
//  unsigned long int before, after;

  // 1108us
//  before = micros ();
   circle(CENX, CENY, radius, SSD1351_WHITE, SSD1351_BLACK);
//  after = micros ();
  
//  Serial.print (after - before);
//  Serial.println ("us. circle 33");
   
// circle(11, 11, 11, SSD1351_RED, -1);
// circle((MAXX - 1) - 11, 11, 11, SSD1351_RED, -1);
// circle((MAXX - 1) - 11, (MAXY - 1) - 11, 11, SSD1351_RED, -1);
// circle(11, (MAXY - 1) - 11, 11, SSD1351_RED, -1);
   
   // Range rings
   if (rings) {
      circle(CENX, CENY, radius / 3, SSD1351_GREEN, -1);
      circle(CENX, CENY, (radius * 2) / 3, SSD1351_GREEN, -1);
   }
  
   // Cardinal directions
   if (axes) {
      drawVline(CENX, CENY - radius, CENY + radius, SSD1351_WHITE);
      drawHline(CENX - radius, CENX + radius, CENY, SSD1351_WHITE);
   }
}


/* drawGatheredTargets --- draw the targets that we've walked over */

void drawGatheredTargets(void)
{
   int t;
   
   for (t = 0; t < NTARGETS; t++) {
      if (Target[t].active == false) {
         circle(6, Target[t].y, Target[t].siz, SSD1351_WHITE, 1);

      if (Target[t].rings)
         circle(12, Target[t].y, 2, SSD1351_WHITE, -1);

      if (Target[t].axes)
         drawPixel(12, Target[t].y, SSD1351_WHITE);
      }
   }
}


/* drawTimer --- visualise the game timer */

void drawTimer(const unsigned int sweeps)
{
   // Very simple vertical bar on RHS of screen.
   unsigned int y;

   fillRect(MAXX - 10, TIMERY, MAXX - 1, MAXGAMEDURATION + TIMERY, 1, 0);
  
   for (y = 1; y <= GameDuration; y++)
      if (y < sweeps)
         drawHline(MAXX - 9, MAXX - 2, y + TIMERY, SSD1351_BLACK);
      else
         drawHline(MAXX - 9, MAXX - 2, y + TIMERY, SSD1351_WHITE);
  
   drawHline(MAXX - 9, MAXX - 2, GameDuration + TIMERY, SSD1351_WHITE);
}


/* drawRadarVector --- draw the radial line representing the current scan vector */

void drawRadarVector(const int radius, const int angle)
{
   // This function draws the radial line three times to make it
   // appear more clearly on the rather slow LCD. A better way
   // would be to draw a narrow sector (pie-slice) so that the
   // pixels have time to fully darken before they get switched
   // back to white. But that would require an efficient sector
   // drawing routine, which we don't have (yet).
   int x, y;
   const float r = (float)radius;

   // 252us
   x = (r * cos ((double)angle / RADTODEG)) + 0.49;
   y = (r * sin ((double)angle / RADTODEG)) + 0.49;

   // 232us
   drawLine(CENX, CENY, CENX + x, CENY + y, SSD1351_GREEN);

   x = (r * cos ((double)(angle + 2) / RADTODEG)) + 0.49;
   y = (r * sin ((double)(angle + 2) / RADTODEG)) + 0.49;

   // 232us
   drawLine(CENX, CENY, CENX + x, CENY + y, SSD1351_GREEN);

   x = (r * cos ((double)(angle + 4) / RADTODEG)) + 0.49;
   y = (r * sin ((double)(angle + 4) / RADTODEG)) + 0.49;

   drawLine(CENX, CENY, CENX + x, CENY + y, SSD1351_GREEN);
}


