anachrocomputer/STM32_SSD1351/RisibleRadar/RisibleRadar.c
/* reCalculateBearings --- update array of target bearings from new player position */

void reCalculateBearings(void)
{
   // We need to know the bearing from the player to each of the radar
   // targets, so that we can rapidly update the display as the "beam" rotates.
   // In this function, we update the array of bearings and ranges after the
   // player position has changed. 'atan2' computes the arctangent, giving a
   // bearing, without the risk of dividing by zero. The result is -180 to +180
   // degrees, so we add 360 to any negative bearings. Range is worked out by
   // Pythagoras' theorem.
   int i;

   for (i = 0; i < NTARGETS; i++) {
      if (Target[i].active) {
         const int dx = Target[i].x - Player.x;
         const int dy = Target[i].y - Player.y;

         Target[i].bearing = atan2(dy, dx) * RADTODEG;
         Target[i].range = sqrt((dx * dx) + (dy * dy));

         if (Target[i].bearing < 0.0)
            Target[i].bearing += 360.0;
      }
   }
}


/* findEchoSlot --- search the Echo array for an unused slot */

int findEchoSlot(void)
{
   int e;
   
   for (e = 0; e < NECHOES; e++) {
      if (Echo[e].age <= 0)
         return (e);
   }
   
   // We didn't find an empty slot, so overwrite slot 0  
   return (0);
}


/* findNewEchoes --- search the Target array for anything that will cause an echo */

void findNewEchoes(const int r, const int range, const int nt)
{
   // Targets have an 'active' flag so that we can make them disappear
   // after the user walks over them -- currently unimplemented.
   // Some potential additions here: targets that are close to the radar
   // appear larger; make some echoes fade more quickly; give echoes
   // shapes other than circles.
   int t;
   int e;
   const float frange = (float)range;
   const float pickup = frange / 3.0;

   for (t = 0; t < nt; t++) {
      if (Target[t].active) {                            // Currently active?
         if (abs(Target[t].bearing - (float)r) < 6.0) {  // In the right direction?
           if (Target[t].range < frange) {               // Close enough?
              // Make a new echo
              e = findEchoSlot();
              Echo[e].x = CENX + (Target[t].x - Player.x);  // Make player-relative co-ordinates
              Echo[e].y = CENY + (Target[t].y - Player.y);
              Echo[e].age = 270;                            // Echoes last 3/4 of a revolution
              Echo[e].rad = Target[t].siz;                  // Target size affects echo size
             
              if (Target[t].range < pickup) {  // Pick it up?
                 Target[t].active = false;
                 Target[t].y = Gather_y;
                 Gather_y += 6;
              }
           }
         }

         if (Target[t].range < pickup) {  // Close enough for bonus (regardless of bearing)?
            if (Target[t].rings)
               Rings = true;      // Enable range rings
             
            if (Target[t].axes)
               Axes = true;       // Enable axes
             
            if (Target[t].time) {
               if (GameDuration < MAXGAMEDURATION)    // Give user more time
                  GameDuration += 5;
             
               Target[t].time = false;  // Only trigger once!
               printf("More time: Target[%d] (%d,%d)\n", t, Target[t].x, Target[t].y);
            }
         }
      }
   }
}


/* getPlayerMove --- read the analog joystick */

int getPlayerMove(void)
{
   // The analog joystick is on STM32 analog pins 1 and 8 for
   // X and Y respectively. The range of an analog input is
   // 0-4095 (12 bits), so the middle position is about 2048.
   // At present, only four movement directions are possible.
   int x, y;
   int dir = 0;

   x = analogRead(1);
   y = analogRead(8);

   if (x < (ADC_CENTRE - ADC_DEADBAND))
     dir = WEST;
   else if (x > (ADC_CENTRE + ADC_DEADBAND))
     dir = EAST;

   if (y < (ADC_CENTRE - ADC_DEADBAND))
     dir = NORTH;
   else if (y > (ADC_CENTRE + ADC_DEADBAND))
     dir = SOUTH;
    
   //printf("Joy: %d (%d,%d)\n", dir, x, y);

   switch (dir) {
   case 0:
      break;
   case NORTH:
      renderBitmap(0, 0, 24, 24, &Arrows[0][0], 240, SSD1351_GREEN, SSD1351_BLACK);
      //setText(0, 0, "North");
      break;
   case SOUTH:
      renderBitmap(0, 0, 24, 24, &Arrows[0][24], 240, SSD1351_GREEN, SSD1351_BLACK);
      //setText(0, 0, "South");
      break;
   case EAST:
      setText(0, 0, "East");
      break;
   case WEST:
      setText(0, 0, "West");
      break;
   }

   return (dir);
}


/* movePlayer --- make player move and update bearings */

void movePlayer(const int dir)
{
   switch (dir) {
   case NORTH:
      if (Player.y > 0)
         Player.y--;
      break;
   case SOUTH:
      if (Player.y < (MAXPLAYY - 1))
         Player.y++;
      break;
   case WEST:
      if (Player.x > 0)
         Player.x--;
      break;
   case EAST:
      if (Player.x < (MAXPLAYX - 1))
         Player.x++;
      break;
   }
  
   //printf("New player pos: (%d,%d)\n", Player.x, Player.y);
}


/* _write --- connect stdio functions to UART1 */

int _write(const int fd, const char *ptr, const int len)
{
   int i;

   for (i = 0; i < len; i++) {
      if (*ptr == '\n')
         UART1TxByte('\r');
      
      UART1TxByte(*ptr++);
   }
  
   return (len);
}


/* delay --- Arduino-like function to delay for miliiseconda */

void delay(const int milliSeconds)
{
   const int end = millis() + milliSeconds;
   
   while (millis() < end)
      ;
}


/* random --- Arduino-like function to return a random number */

int random(const int low, const int high)
{
   const int span = high - low;
   const float r = (float)rand() / (float)RAND_MAX;
   
   return ((int)((low + (r * span)) + 0.5));
}


/* game_setup --- initialise the game logic */

void game_setup(void)
{
   int i;
   
   OLED_begin(MAXX, MAXY);
   
   greyFrame();
    
   updscreen(0, MAXY - 1);
   
   printf("RisibleRadar\n");
   printf("John Honniball, June 2024\n");
   printf("Ludum Dare MiniLD #34: Aspect\n");
   
   // Targets scattered on playfield at random
   for (i = 0; i < NTARGETS; i++) {
      do {
         Target[i].x = random(0, MAXPLAYX);
         Target[i].y = random(0, MAXPLAYY);
      
