anachrocomputer/STM32_SSD1351/RisibleRadar/RisibleRadar.c
         Target[i].active = true;
         Target[i].rings = false;
         Target[i].axes = false;
         Target[i].time = false;
         Target[i].siz = random(1, 3);
         printf("%d: (%d, %d) siz: %d\n", i, Target[i].x, Target[i].y, Target[i].siz);
         // TODO: make sure no two targets are too close together
      } while (0);
   }
  
   // Place the 'bonus' targets somewhere
   i = random (0, NTARGETS - 1);
   Target[i].rings = true;

   i = random (0, NTARGETS - 1);
   Target[i].axes = true;

   i = random (0, NTARGETS - 1);
   Target[i].time = true;

   i = random (0, NTARGETS - 1);
   Target[i].time = true;

   // Start the player in centre of playfield
   Player.x = MAXPLAYX / 2;
   Player.y = MAXPLAYY / 2;
   
   reCalculateBearings();

   drawBackground();

   drawRadarScreen(SCANNER_RADIUS, true, true);

   textRoundRect("Risible Radar", SSD1351_WHITE, SSD1351_BLACK, SSD1351_WHITE);

   updscreen(0, MAXY - 1);

   delay(2000);

   drawBackground();

   drawRadarScreen(SCANNER_RADIUS, true, true);

   textRoundRect("READY", SSD1351_WHITE, SSD1351_BLACK, SSD1351_WHITE);

   updscreen(0, MAXY - 1);
   
   // Wait here for user to press Start
}


/* game_loop --- main loop for the RisibleRadar game */

void game_loop(void)
{
   static unsigned int sweeps = 0;
   int r;
   int dir;
   int e;
   long int start, now;
   int elapsed;

   for (r = 0; r < 360; r += SCANNER_INC_DEGREES) {
      // Record timer in milliseconds at start of frame cycle
      start = millis();

      // Draw empty radar scope
      drawBackground();

      drawRadarScreen(SCANNER_RADIUS, Rings, Axes);

      drawGatheredTargets();

      if (sweeps < GameDuration) {
         dir = getPlayerMove();

         if (dir != 0) {
            movePlayer(dir);
            reCalculateBearings();
         }
      }
    
      // Draw current scan vector
      drawRadarVector(SCANNER_RADIUS, r);

      // Do we have any new echoes for this scanner bearing?
      findNewEchoes(r, SCANNER_RADIUS, NTARGETS);

      // Add un-faded echoes
      for (e = 0; e < NECHOES; e++) {
         if (Echo[e].age > 0)
            circle(Echo[e].x, Echo[e].y, Echo[e].rad, SSD1351_GREEN, SSD1351_GREEN);

         Echo[e].age -= SCANNER_INC_DEGREES;
      }
    
      if (r == 180)
         sweeps++;
      
      if (sweeps < GameDuration) {
         drawTimer(sweeps);
      }
      else {
         textRoundRect("GAME OVER", SSD1351_WHITE, SSD1351_BLACK, SSD1351_WHITE);
      }
      
      // Update LCD for this frame
      updscreen(0, MAXY - 1);
      
      // Work out timing for this frame
      now = millis();
      elapsed = now - start;
    
//    printf("%dms.\n", elapsed);
    
      if (elapsed < 40)
         delay(40 - elapsed);
   }

   sweeps++;
}


/* initMCU --- set up the microcontroller in general */

static void initMCU(void)
{
   RCC->CR      = 0x00000081;
   RCC->CFGR    = 0x00000000;
   RCC->PLLCFGR = 0x24003010;
   
   FLASH->ACR |= FLASH_ACR_LATENCY_2WS;   // Set Flash latency to 2 wait states
   FLASH->ACR |= FLASH_ACR_ICEN;          // Cache enable
   FLASH->ACR |= FLASH_ACR_DCEN;
   FLASH->ACR |= FLASH_ACR_PRFTEN;        // Prefetch enable
   
   RCC->CFGR |= RCC_CFGR_PPRE1_DIV2;   // Set APB1 bus to not exceed 50MHz
   //RCC->CFGR |= RCC_CFGR_PPRE2_DIV2;    // Set APB2 bus to not exceed 100MHz
   
#if 0
   // Switch on MCO1 for debugging
   RCC->AHB1ENR |= RCC_AHB1ENR_GPIOAEN;         // Enable clock to GPIO A peripherals on AHB1 bus

   // Configure PA8, the GPIO pin with alternative function MCO1
   GPIOA->MODER |= GPIO_MODER_MODER8_1;          // PA8 in Alternative Function mode
   GPIOA->OSPEEDR |= GPIO_OSPEEDER_OSPEEDR8_1 | GPIO_OSPEEDER_OSPEEDR8_0;

   RCC->CFGR |= RCC_CFGR_MCO1_1 | RCC_CFGR_MCO1_0;                 // Send PLL to MCO1
   RCC->CFGR |= RCC_CFGR_MCO1PRE_0 | RCC_CFGR_MCO1PRE_1 | RCC_CFGR_MCO1PRE_2; // Prescale divide-by-5
#endif
   
   RCC->CR |= RCC_CR_HSEON;    // Switch on High Speed External clock (25MHz on the Black Pill)

   // Wait for HSE to start up
   while ((RCC->CR & RCC_CR_HSERDY) == 0)
      ;
   
   // Configure PLL
   RCC->PLLCFGR &= ~RCC_PLLCFGR_PLLQ;
   RCC->PLLCFGR |= RCC_PLLCFGR_PLLQ_2 | RCC_PLLCFGR_PLLQ_1 | RCC_PLLCFGR_PLLQ_0;   // Set Q to divide-by 7

   RCC->PLLCFGR &= ~RCC_PLLCFGR_PLLP;            // P = divide-by-2

   RCC->PLLCFGR &= ~RCC_PLLCFGR_PLLN;
   RCC->PLLCFGR |= 200 << RCC_PLLCFGR_PLLN_Pos;    // N = multiply-by-200

   RCC->PLLCFGR &= ~RCC_PLLCFGR_PLLM;
   RCC->PLLCFGR |= 25 << RCC_PLLCFGR_PLLM_Pos;     // M = divide-by-25 for 1MHz PLL input

   RCC->PLLCFGR |= RCC_PLLCFGR_PLLSRC_HSE;    // Select HSE as PLL input
   
   RCC->CR |= RCC_CR_PLLON;             // Switch on the PLL

   // Wait for PLL to start up
   while ((RCC->CR & RCC_CR_PLLRDY) == 0)
      ;

   uint32_t reg = RCC->CFGR;
   reg &= ~RCC_CFGR_SW;
   reg |= RCC_CFGR_SW_PLL;          // Select PLL as system clock (100MHz)
   RCC->CFGR = reg;
   
   // Wait for PLL to select
   while ((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_PLL)
      ;
   
   RCC->CSR |= RCC_CSR_RMVF;
}


/* initGPIOs --- set up the GPIO pins */

static void initGPIOs(void)
{
   // Configure Reset and Clock Control
   RCC->AHB1ENR |= RCC_AHB1ENR_GPIOAEN;      // Enable clock to GPIO A peripherals on AHB1 bus
   RCC->AHB1ENR |= RCC_AHB1ENR_GPIOBEN;      // Enable clock to GPIO B peripherals on AHB1 bus
   RCC->AHB1ENR |= RCC_AHB1ENR_GPIOCEN;      // Enable clock to GPIO C peripherals on AHB1 bus
   
   // Configure PA0, the GPIO pin with the button
   GPIOA->PUPDR |= GPIO_PUPDR_PUPD0_0;       // Enable pull-up on PA0
   
   // Configure PB12, the GPIO pin with the red LED
   GPIOB->MODER |= GPIO_MODER_MODER12_0;     // Configure PB12 as output for the red LED
   
   // Configure PB13, the GPIO pin with the green LED
   GPIOB->MODER |= GPIO_MODER_MODER13_0;     // Configure PB13 as output for the green LED
   
   // Configure PB14, the GPIO pin with the blue LED
   GPIOB->MODER |= GPIO_MODER_MODER14_0;     // Configure PB14 as output for the blue LED
   
   // Configure PC13, the GPIO pin with the on-board blue LED
   GPIOC->MODER |= GPIO_MODER_MODER13_0;     // Configure PC13 as output for the on-board LED
   
   // Configure PC14, the GPIO pin with 500Hz square wave
   GPIOC->MODER |= GPIO_MODER_MODER14_0;     // Configure PC14 as output, 500Hz square wave
}


/* initUARTs --- set up UART(s) and buffers, and connect to 'stdout' */

static void initUARTs(void)
{
   RCC->AHB1ENR |= RCC_AHB1ENR_GPIOAEN;        // Enable clock to GPIO A peripherals on AHB1 bus
   RCC->APB2ENR |= RCC_APB2ENR_USART1EN;       // Enable USART1 clock
   
   // Set up UART1 and associated circular buffers
   U1Buf.tx.head = 0;
   U1Buf.tx.tail = 0;
   U1Buf.rx.head = 0;
   U1Buf.rx.tail = 0;
   
   // Configure PA9, the GPIO pin with alternative function TxD2
   GPIOA->MODER |= GPIO_MODER_MODER9_1;        // PA9 in Alternative Function mode
   GPIOA->AFR[1] |= 7 << 4;                    // Configure PA9 as alternate function, AF7, UART1
  
   // Configure PA10, the GPIO pin with alternative function RxD2
   GPIOA->MODER |= GPIO_MODER_MODER10_1;       // PA10 in Alternative Function mode
   GPIOA->AFR[1] |= 7 << 8;                    // Configure PA10 as alternate function, AF7, UART1
   
   // Configure UART1 - defaults are 1 start bit, 8 data bits, 1 stop bit, no parity
   USART1->CR1 |= USART_CR1_UE;           // Switch on the UART
   USART1->BRR |= (651<<4) | 1;           // Set for 9600 baud (reference manual page 518) 100000000 / (16 * 9600)
   USART1->CR1 |= USART_CR1_RXNEIE;       // Enable Rx Not Empty interrupt
   USART1->CR1 |= USART_CR1_TE;           // Enable transmitter (sends a junk character)
   USART1->CR1 |= USART_CR1_RE;           // Enable receiver
   
   NVIC_EnableIRQ(USART1_IRQn);
}


/* initTimers --- set up timer for regular 1Hz interrupts */

static void initTimers(void)
{
   // The STM32F103 does not have Basic Timers 6 and 7. So, we'll use TIM4 to
   // generate regular interrupts. TIM4 has a 16-bit prescaler and a 16-bit counter register
   
   RCC->APB1ENR |= RCC_APB1ENR_TIM4EN;        // Enable Timer 4 clock
   
